/*
###################################################################################
#
# CubeZ
#
# Copyright (C) 2018 Research Institute for Information Technology(RIIT), Kyushu University.
# All rights reserved.
#
###################################################################################
 */

// @file test3.cpp
// @note TDMA test with Dirichlet BC

#include "cz.h"

/*
    D1                         D2
    |                          |
    |                          |
    |--+--+--+--......+--+--+--|
    0  1  2  3  ......  22 23 24


  BC
    <Dirichlet> ==> 係数はデフォルトで、ソース項にマイナス値
    D1 = -3.0
    D2 =  9.0
 */

//  内点の数
#define N 23

int main(int argc, char *argv[])
{
  //                   0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
  REAL_TYPE a[N+2] = { 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0};
  REAL_TYPE b[N+2] = { 0,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2, 0};
  REAL_TYPE c[N+2] = { 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0};
  REAL_TYPE d[N+2] = {-3, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-9, 9};
  // d[]はRHSと解ベクトルに利用、置換は端点以外
  // 端点には境界条件、それ以外はソース項

  REAL_TYPE w[N+2], g[N+2];
  int n = N;

  // 内点の個数と、その先頭アドレス
  tdma_0_(&n, &d[1], &a[1], &b[1], &c[1], &w[1]);

  for (int i=0; i<n+2; i++) {
    printf("[%2d] %6.3f\n", i, d[i]);
  }

  return 0;
}
